src/main/resources/atscale-small/0009-req.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <Session xmlns="urn:schemas-microsoft-com:xml-analysis" SessionId="58EC67E6-8668-4A29-BA07-491F8C4E2B18"/>
  </soap:Header>
  <soap:Body>
    <Execute xmlns="urn:schemas-microsoft-com:xml-analysis">
      <Command>
        <Statement>REFRESH CUBE [AS Adventure Micro]</Statement>
      </Command>
      <Properties>
        <PropertyList>
          <Catalog>ASAdventureMicro</Catalog>
          <Timeout>0</Timeout>
          <Format>Native</Format>
          <DbpropMsmdFlattened2>false</DbpropMsmdFlattened2>
          <SafetyOptions>2</SafetyOptions>
          <Dialect>MDX</Dialect>
          <MdxMissingMemberMode>Error</MdxMissingMemberMode>
          <DbpropMsmdOptimizeResponse>9</DbpropMsmdOptimizeResponse>
          <DbpropMsmdActivityID>BF00EFBA-6825-45D4-AD5D-F26EB2C668E6</DbpropMsmdActivityID>
          <DbpropMsmdRequestID>F9AAA32A-33BF-4C4D-90C0-DA86E5519C7A</DbpropMsmdRequestID>
          <LocaleIdentifier>1033</LocaleIdentifier>
          <DbpropMsmdMDXCompatibility>1</DbpropMsmdMDXCompatibility>
          <DbpropMsmdSubqueries>2</DbpropMsmdSubqueries>
        </PropertyList>
      </Properties>
    </Execute>
  </soap:Body>
</soap:Envelope>